# Project 3 - Part 3

## Business problem

- Produce a MySQL database on movies from a subset of IMDB's publicly available dataset.
- Use this database to analyze what makes a movie successful.
- Provide recommendations to the stakeholder on how to make a successful movie.

## Requirements

- Create a new MySQL database after preparing the data for a relational database.
- Export your database to a .sql file in your repository using MySQL Workbench.

### Database Specifications
#### Title Basics:
- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

#### Title Ratings:
- Movie ID (tconst)
- Average Movie Rating
- Number of Votes

#### The TMDB API Results (multiple files):
- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)


- Normalize the tables as best you can before adding them to your new database.
- Keep all of the data from the TMDB API in one table together (even though it will not be perfectly normalized).

### Required Transformation Steps

#### Title Basics:
- Normalize Genre: Convert the single string of genres from title basics into 2 new tables (title_genres with the columns tconst and genre_id; and genres with columns genre_id, genre_name)
- Discard unnecessary information by dropping the following columns: original_title, isAdult, titleType, genres and other variants of genre

#### Title AKAS:
- Do not include the title_akas table in your SQL database.

### MySQL Database Requirements
- Use sqlalchemy with Pandas to execute your SQL queries inside your notebook
- Create a new database on your MySQL server and call it "movies"
- Make sure to have the following tables in your "movies" database:
  - title_basics
  - title_ratings
  - title_genres
  - genres
  - tmdb_data
- Set a primary key for each table that isn't a joiner table (e.g., title_genres is a joiner table).
- After creating each table, show the first 5 rows of that table using a SQL query.
- Run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

## Imports

In [1]:
import pandas as pd
import pymysql

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

## Code

In [2]:
## Load data
basics_df = pd.read_csv("Data/title_basics.csv.gz", low_memory=False)
print("Basics data loaded. Shape:", basics_df.shape)  
ratings_df = pd.read_csv("Data/title_ratings.csv.gz", low_memory=False)
print("Ratings data loaded. Shape:", ratings_df.shape)  
tmdb_2000 = pd.read_csv("Data/movies_2000_final.csv.gz", low_memory=False)
print("Movies_2000 data loaded. Shape:", tmdb_2000.shape)  
tmdb_2001 = pd.read_csv("Data/movies_2001_final.csv.gz", low_memory=False)
print("Movies_2001 data loaded. Shape:", tmdb_2001.shape)

Basics data loaded. Shape: (82235, 9)
Ratings data loaded. Shape: (514075, 3)
Movies_2000 data loaded. Shape: (1269, 26)
Movies_2001 data loaded. Shape: (1365, 26)

In [3]:
## Transformation: Title basics
## Normalize genre

## Create a column with a list of genres
basics_df['genres_split'] = basics_df['genres'].str.split(',')
exploded = basics_df.explode('genres_split')
columns = sorted(exploded['genres_split'].unique())
columns

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [4]:
## Create a new table title_genres with columns tconst and genre_id
title_genres = exploded[['tconst', 'genres_split']].copy()

In [5]:
## Rename columns
rename = {'tconst': 'movie_id',
          'genres_split': 'genres_split'}
title_genres.rename(rename, axis=1, inplace=True)
title_genres.head()

    movie_id genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [6]:
## Make a genre mapper dictionary
key = range(len(columns))
genre_map = dict(zip(columns, key))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [7]:
## Add genre_id and drop genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

    movie_id  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [8]:
## Create a new table genres with columns genre_id and genre_name
genres = pd.DataFrame({'genre_id': genre_map.values(),
                      'genre_name': genre_map.keys()})
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [9]:
## Drop columns
cols_todrop = ['originalTitle', 'endYear', 'isAdult', 'titleType', 'genres', 'genres_split']

for col in cols_todrop:
    basics_df = basics_df.drop(columns=col)

In [10]:
## Rename columns
rename = {'tconst': 'movie_id',
          'primaryTitle': 'primary_title',
          'startYear': 'start_year',
          'endYear': 'end_year',
          'runtimeMinutes': 'runtime_minutes'}
basics_df.rename(rename, axis=1, inplace=True)
basics_df.head()

,movie_id,primary_title,start_year,runtime_minutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0082328,Embodiment of Evil,2008,94
4,tt0088751,The Naked Monster,2005,100

In [11]:
## Transformation: TMDB data

## Join tmdb data
tmdb_data = pd.concat([tmdb_2000, tmdb_2001], axis=0)

In [12]:
## Inspect data
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2634 entries, 0 to 1364
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2634 non-null   object
 1   adult                  2632 non-null   float64
 2   backdrop_path          1477 non-null   object
 3   belongs_to_collection  219 non-null    object
 4   budget                 2632 non-null   float64
 5   genres                 2632 non-null   object
 6   homepage               172 non-null    object
 7   id                     2632 non-null   float64
 8   original_language      2632 non-null   object
 9   original_title         2632 non-null   object
 10  overview               2580 non-null   object
 11  popularity             2632 non-null   float64
 12  poster_path            2391 non-null   object
 13  production_companies   2632 non-null   object
 14  production_countries   2632 non-null   object
 15  release_date           2608 non-null   object
 16  revenue                2632 non-null   float64
 17  runtime                2632 non-null   float64
 18  spoken_languages       2632 non-null   object
 19  status                 2632 non-null   object
 20  tagline                1134 non-null   object
 21  title                  2632 non-null   object
 22  video                  2632 non-null   float64
 23  vote_average           2632 non-null   float64
 24  vote_count             2632 non-null   float64
 25  certification          779 non-null    object
dtypes: float64(9), object(17)
memory usage: 555.6+ KB

In [13]:
## Include only required columns
cols_incl = ['imdb_id', 'revenue', 'budget', 'certification']
tmdb_data = tmdb_data[cols_incl].copy()

In [14]:
## Rename columns
rename = {'imdb_id': 'movie_id',
         'revenue': 'revenue',
         'budget': 'budget',
         'certification': 'certification'}
tmdb_data.rename(rename, axis=1, inplace=True)

## Remove rows where movie_id = 0
tmdb_data = tmdb_data[tmdb_data['movie_id'] != '0']

tmdb_data.head()

    movie_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [15]:
## Transformation: Ratings

## Rename columns
rename = {'tconst': 'movie_id',
         'averageRating': 'average_rating',
         'numVotes': 'num_votes'}
ratings_df.rename(rename, axis=1, inplace=True)
ratings_df.head()

    movie_id  average_rating  num_votes
0  tt0000001             5.7       2007
1  tt0000002             5.8        269
2  tt0000005             6.2       2692
3  tt0000006             5.0        182
4  tt0000007             5.4        841

In [16]:
## Export as .csv file
basics_df.to_csv("Data/basics_sql.csv", index=False)
title_genres.to_csv("Data/title_genres_sql.csv", index=False)
genres.to_csv("Data/genres_sql.csv", index=False)
ratings_df.to_csv("Data/ratings_sql.csv", index=False)
tmdb_data.to_csv("Data/tmdb_data_sql.csv", index=False)

In [17]:
## SQL setup
pymysql.install_as_MySQLdb()

## Create connection
username = 'root'
password = 'root'
db_name = 'movies'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

## Create engine
engine = create_engine(connection)

In [20]:
## Create and use database
create_database(connection)

In [21]:
## Check columns
df_list = ['basics_df', 'title_genres', 'genres', 'ratings_df', 'tmdb_data']

for df_name in df_list:
    df = locals()[df_name]
    df.info()
    print('\n')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82235 entries, 0 to 82234
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         82235 non-null  object
 1   primary_title    82235 non-null  object
 2   start_year       82235 non-null  int64
 3   runtime_minutes  82235 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.5+ MB


<class 'pandas.core.frame.DataFrame'>
Int64Index: 154354 entries, 0 to 82234
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   movie_id  154354 non-null  object
 1   genre_id  154354 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_id    25 non-null     int64
 1   genre_name  25 non-null     object
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 514075 entries, 0 to 514074
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   movie_id        514075 non-null  object
 1   average_rating  514075 non-null  float64
 2   num_votes       514075 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.8+ MB


<class 'pandas.core.frame.DataFrame'>
Int64Index: 2632 entries, 1 to 1364
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       2632 non-null   object
 1   revenue        2632 non-null   float64
 2   budget         2632 non-null   float64
 3   certification  779 non-null    object
dtypes: float64(2), object(2)
memory usage: 102.8+ KB

In [22]:
## Calculate max lengths for text columns
id_len = basics_df['movie_id'].fillna('').map(len).max()
title_len = basics_df['primary_title'].fillna('').map(len).max()
genre_name_len = genres['genre_name'].fillna('').map(len).max()
certification_len = tmdb_data['certification'].fillna('').map(len).max()

In [30]:
## Create a schema dictonary
movies_schema = {
    "movie_id": String(id_len+1), 
    "primary_title": String(title_len+1),
    'start_year': Integer(),
    'runtime_minutes': Integer(),
    'genre_id': Integer(),
    'genre_name': Text(genre_name_len+1),
    'average_rating': Float(),
    'num_votes': Integer(),
    'revenue': Float(),
    'budget': Float(),
    'certification': String(certification_len+1)}

In [31]:
## Create tables
basics_df.to_sql('title_basics', engine, index=False, if_exists='replace')
title_genres.to_sql('title_genres', engine, index=False, if_exists='replace')
genres.to_sql('genres', engine, index=False, if_exists='replace')
ratings_df.to_sql('title_ratings', engine, index=False, if_exists='replace')
tmdb_data.to_sql('tmdb_data', engine, index=False, if_exists='replace')

2632

In [33]:
## Explicitly define movie_id and genre_id as VARCHAR
engine.execute('ALTER TABLE title_basics MODIFY movie_id VARCHAR(255);')
engine.execute('ALTER TABLE genres MODIFY genre_id VARCHAR(255);')
engine.execute('ALTER TABLE title_ratings MODIFY movie_id VARCHAR(255);')
engine.execute('ALTER TABLE tmdb_data MODIFY movie_id VARCHAR(255);')

In [34]:
## Add primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`movie_id`);')
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`movie_id`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`movie_id`);')

In [36]:
## Show first five rows of each table
pd.read_sql("SELECT * FROM title_basics LIMIT 5;", connection)

,movie_id,primary_title,start_year,runtime_minutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0082328,Embodiment of Evil,2008,94
4,tt0088751,The Naked Monster,2005,100

In [37]:
pd.read_sql("SELECT * FROM title_genres LIMIT 5;", connection)

    movie_id  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [38]:
pd.read_sql("SELECT * FROM genres LIMIT 5;", connection)

  genre_id genre_name
0        0     Action
1        1      Adult
2       10  Game-Show
3       11    History
4       12     Horror

In [39]:
pd.read_sql("SELECT * FROM title_ratings LIMIT 5;", connection)

    movie_id  average_rating  num_votes
0  tt0000001             5.7       2007
1  tt0000002             5.8        269
2  tt0000005             6.2       2692
3  tt0000006             5.0        182
4  tt0000007             5.4        841

In [40]:
pd.read_sql("SELECT * FROM tmdb_data LIMIT 5;", connection)

    movie_id     revenue      budget certification
0  tt0035423  76019048.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

In [41]:
## Run SHOW TABLES
pd.read_sql("SHOW TABLES IN movies;", connection)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data